In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\dell\anaconda3\lib\site-packages (1.1.3)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\dell\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: numpy>=1.15.4 in c:\users\dell\anaconda3\lib\site-packages (from pandas) (1.19.2)
Requirement already satisfied: pytz>=2017.2 in c:\users\dell\anaconda3\lib\site-packages (from pandas) (2020.1)
Requirement already satisfied: six>=1.5 in c:\users\dell\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)
Note: you may need to restart the kernel to use updated packages.

## Pandas Series

In [2]:
import pandas as pd
import numpy as np

In [5]:
labels = ['a','b','c','d']
myList = [1,2,3,4]
myDict = {1:'a', 2:'b',3:'c'}

In [9]:
pd.Series(data = myList)   # for series

0    1
1    2
2    3
3    4
dtype: int64

In [5]:
ser = pd.Series(data = myList, index = labels)
ser

a    1
b    2
c    3
d    4
dtype: int64

In [6]:
ser1 = pd.Series(data = myDict)

In [7]:
ser1

1    a
2    b
3    c
dtype: object

In [8]:
ser[3]

4

In [9]:
ser['d']

4

## Pandas Dataframe

In [10]:
pd.DataFrame(data = np.random.randn(5,4))

          0         1         2         3
0 -0.818490  1.186206  1.049510 -0.403177
1 -0.120743  1.076144 -1.214751  0.577787
2 -0.579559  0.115057  0.677098  0.216920
3  1.096077  0.620487  0.005777  0.769728
4 -0.358349  0.615758 -0.855237  1.179461

In [11]:
pd.DataFrame(data = np.random.randn(5,4), index= ['a','b','c','d','e'])

          0         1         2         3
a  0.896783  1.658861 -0.648519  0.631330
b  1.343012 -0.589863  0.332772  0.180737
c  0.832501 -0.728561  0.585273 -2.373100
d  1.235576 -0.301387  0.873905 -0.590568
e  0.129706 -0.287685 -0.490854 -0.338255

In [11]:
df = pd.DataFrame(data = np.random.randn(5,4), index = ['a','b','c','d','e'], columns = ['w','x','y','z'])
df

          w         x         y         z
a  1.178629  1.689614  0.045112 -1.288736
b -1.736562  0.616248 -1.022990  1.106109
c -0.205342 -0.114675 -1.700871 -0.998730
d  0.292745  0.953307  0.275791  0.385816
e  0.101172 -0.668381 -0.477666  0.777746

In [12]:
df['x']

a    1.689614
b    0.616248
c   -0.114675
d    0.953307
e   -0.668381
Name: x, dtype: float64

In [13]:
df['y']

a    0.045112
b   -1.022990
c   -1.700871
d    0.275791
e   -0.477666
Name: y, dtype: float64

In [14]:
df[['w','z']]

          w         z
a  1.178629 -1.288736
b -1.736562  1.106109
c -0.205342 -0.998730
d  0.292745  0.385816
e  0.101172  0.777746

In [33]:
df['new_column'] = df['w'] + df['z']

In [34]:
df

          w         x         y         z  new_column
a  1.178629  1.689614  0.045112 -1.288736   -0.110107
b -1.736562  0.616248 -1.022990  1.106109   -0.630453
c -0.205342 -0.114675 -1.700871 -0.998730   -1.204071
d  0.292745  0.953307  0.275791  0.385816    0.678561
e  0.101172 -0.668381 -0.477666  0.777746    0.878918

In [21]:
df['new_column'] = [0,2,3,7,5]

In [25]:
df

          w         x         y         z  new_column
a  1.178629  1.689614  0.045112 -1.288736           0
b -1.736562  0.616248 -1.022990  1.106109           2
c -0.205342 -0.114675 -1.700871 -0.998730           3
d  0.292745  0.953307  0.275791  0.385816           7
e  0.101172 -0.668381 -0.477666  0.777746           5

In [24]:
df.shape

(5, 5)

In [35]:
df.drop('new_column', axis=1)

          w         x         y         z
a  1.178629  1.689614  0.045112 -1.288736
b -1.736562  0.616248 -1.022990  1.106109
c -0.205342 -0.114675 -1.700871 -0.998730
d  0.292745  0.953307  0.275791  0.385816
e  0.101172 -0.668381 -0.477666  0.777746

In [37]:
df              # adding data is inplace  but dropping data is not in place

          w         x         y         z  new_column
a  1.178629  1.689614  0.045112 -1.288736   -0.110107
b -1.736562  0.616248 -1.022990  1.106109   -0.630453
c -0.205342 -0.114675 -1.700871 -0.998730   -1.204071
d  0.292745  0.953307  0.275791  0.385816    0.678561
e  0.101172 -0.668381 -0.477666  0.777746    0.878918

In [39]:
df.drop('new_column', axis =1, inplace = True)

In [40]:
df

          w         x         y         z
a  1.178629  1.689614  0.045112 -1.288736
b -1.736562  0.616248 -1.022990  1.106109
c -0.205342 -0.114675 -1.700871 -0.998730
d  0.292745  0.953307  0.275791  0.385816
e  0.101172 -0.668381 -0.477666  0.777746

In [42]:
df.loc['a']          # gives all values of a row/index.

w    1.178629
x    1.689614
y    0.045112
z   -1.288736
Name: a, dtype: float64

In [50]:
df.iloc[2]           # gives all values of a row/index and it takes index of row.

w   -0.205342
x   -0.114675
y   -1.700871
z   -0.998730
Name: c, dtype: float64

In [49]:
df.loc['d']

w    0.292745
x    0.953307
y    0.275791
z    0.385816
Name: d, dtype: float64

In [48]:
df.loc[['a','b'], ['w','z']]

          w         z
a  1.178629 -1.288736
b -1.736562  1.106109

In [47]:
df['w']>0

a     True
b    False
c    False
d     True
e     True
Name: w, dtype: bool

In [51]:
df[df['w']>0]       # print those which are true

          w         x         y         z
a  1.178629  1.689614  0.045112 -1.288736
d  0.292745  0.953307  0.275791  0.385816
e  0.101172 -0.668381 -0.477666  0.777746

In [52]:
df[df['w']>0]['x']

a    1.689614
d    0.953307
e   -0.668381
Name: x, dtype: float64

In [53]:
df['new'] = ['A','B','C','D','E']

In [54]:
df

          w         x         y         z new
a  1.178629  1.689614  0.045112 -1.288736   A
b -1.736562  0.616248 -1.022990  1.106109   B
c -0.205342 -0.114675 -1.700871 -0.998730   C
d  0.292745  0.953307  0.275791  0.385816   D
e  0.101172 -0.668381 -0.477666  0.777746   E

In [57]:
df.set_index('new') # as old indexes are getting deleted , this command is not inplace by default.

            w         x         y         z
new
A    1.178629  1.689614  0.045112 -1.288736
B   -1.736562  0.616248 -1.022990  1.106109
C   -0.205342 -0.114675 -1.700871 -0.998730
D    0.292745  0.953307  0.275791  0.385816
E    0.101172 -0.668381 -0.477666  0.777746

In [59]:
df

          w         x         y         z new
a  1.178629  1.689614  0.045112 -1.288736   A
b -1.736562  0.616248 -1.022990  1.106109   B
c -0.205342 -0.114675 -1.700871 -0.998730   C
d  0.292745  0.953307  0.275791  0.385816   D
e  0.101172 -0.668381 -0.477666  0.777746   E

In [60]:
df.set_index('new', inplace = True)

In [61]:
df

            w         x         y         z
new
A    1.178629  1.689614  0.045112 -1.288736
B   -1.736562  0.616248 -1.022990  1.106109
C   -0.205342 -0.114675 -1.700871 -0.998730
D    0.292745  0.953307  0.275791  0.385816
E    0.101172 -0.668381 -0.477666  0.777746

## Groupby

In [74]:
data = {'Employee_Company':['GOOGLE','GOOGLE','MICROSOFT','MICROSOFT','FACEBOOK','FACEBOOK'],'employee_id':['P1','P2','P3','P4','P5','P6'],'Salery':[4500,5500,6500,3400,2300,1200]}

In [75]:
df = pd.DataFrame(data)
df

  Employee_Company employee_id  Salery
0           GOOGLE          P1    4500
1           GOOGLE          P2    5500
2        MICROSOFT          P3    6500
3        MICROSOFT          P4    3400
4         FACEBOOK          P5    2300
5         FACEBOOK          P6    1200

In [76]:
df.sum()

Employee_Company    GOOGLEGOOGLEMICROSOFTMICROSOFTFACEBOOKFACEBOOK
employee_id                                           P1P2P3P4P5P6
Salery                                                       23400
dtype: object

In [77]:
df.groupby('Employee_Company').max()

                 employee_id  Salery
Employee_Company
FACEBOOK                  P6    2300
GOOGLE                    P2    5500
MICROSOFT                 P4    6500

In [79]:
df.groupby('Employee_Company').sum()

                  Salery
Employee_Company
FACEBOOK            3500
GOOGLE             10000
MICROSOFT           9900

In [80]:
df.describe()

            Salery
count     6.000000
mean   3900.000000
std    1988.969582
min    1200.000000
25%    2575.000000
50%    3950.000000
75%    5250.000000
max    6500.000000

In [81]:
df.groupby('Employee_Company').describe()

                 Salery                                                       \
                  count    mean          std     min     25%     50%     75%
Employee_Company
FACEBOOK            2.0  1750.0   777.817459  1200.0  1475.0  1750.0  2025.0
GOOGLE              2.0  5000.0   707.106781  4500.0  4750.0  5000.0  5250.0
MICROSOFT           2.0  4950.0  2192.031022  3400.0  4175.0  4950.0  5725.0


                     max
Employee_Company
FACEBOOK          2300.0
GOOGLE            5500.0
MICROSOFT         6500.0

# Concatination:

In [86]:
# concat syntax  pd.concat(first dataFrame, 2nd dataFrame, Index):

In [102]:
pd.concat([df, pd.DataFrame({'Employee_Company':'AMAZON','employee_id':'P7','Salery':6700}, index=[6]) ])

  Employee_Company employee_id  Salery
0           GOOGLE          P1    4500
1           GOOGLE          P2    5500
2        MICROSOFT          P3    6500
3        MICROSOFT          P4    3400
4         FACEBOOK          P5    2300
5         FACEBOOK          P6    1200
6           AMAZON          P7    6700

In [98]:
df = pd.concat([df, pd.DataFrame([1,2,3,4,5,6],columns= ['Number'])],axis =1)  # ran comd twice for two number columns
df

  Employee_Company employee_id  Salery  Number  Number  Number
0           GOOGLE          P1    4500       1       1       1
1           GOOGLE          P2    5500       2       2       2
2        MICROSOFT          P3    6500       3       3       3
3        MICROSOFT          P4    3400       4       4       4
4         FACEBOOK          P5    2300       5       5       5
5         FACEBOOK          P6    1200       6       6       6

In [99]:
df.drop('Number', axis= 1,inplace = True)

In [103]:
df

  Employee_Company employee_id  Salery
0           GOOGLE          P1    4500
1           GOOGLE          P2    5500
2        MICROSOFT          P3    6500
3        MICROSOFT          P4    3400
4         FACEBOOK          P5    2300
5         FACEBOOK          P6    1200

## Miscellaneous

In [105]:
df['Employee_Company'].unique()

array(['GOOGLE', 'MICROSOFT', 'FACEBOOK'], dtype=object)

In [106]:
df['Employee_Company'].nunique()

3

In [108]:
df['Employee_Company'].count()

6

In [110]:
df.groupby('Employee_Company').count()

                  employee_id  Salery
Employee_Company
FACEBOOK                    2       2
GOOGLE                      2       2
MICROSOFT                   2       2

In [62]:
df['Company'].value_counts()

MICROSOFT    2
GOOGLE       2
FACEBOOK     2
Name: Company, dtype: int64

In [113]:
def times2(value):                  #function
    return value*2

In [114]:
df['Salery'].apply(times2)

0     9000
1    11000
2    13000
3     6800
4     4600
5     2400
Name: Salery, dtype: int64

In [115]:
df['Salery'].apply(lambda x: x*2)        #lambda function

0     9000
1    11000
2    13000
3     6800
4     4600
5     2400
Name: Salery, dtype: int64

In [116]:
df['Employee_Company'].apply(len)

0    6
1    6
2    9
3    9
4    8
5    8
Name: Employee_Company, dtype: int64

In [70]:
df.apply(len)

Company    6
Person     6
Sales      6
0          6
0          6
Number     6
dtype: int64

In [117]:
df.sort_values('Salery', ascending= False)

  Employee_Company employee_id  Salery
2        MICROSOFT          P3    6500
1           GOOGLE          P2    5500
0           GOOGLE          P1    4500
3        MICROSOFT          P4    3400
4         FACEBOOK          P5    2300
5         FACEBOOK          P6    1200

In [118]:
df.drop(5)

  Employee_Company employee_id  Salery
0           GOOGLE          P1    4500
1           GOOGLE          P2    5500
2        MICROSOFT          P3    6500
3        MICROSOFT          P4    3400
4         FACEBOOK          P5    2300

In [119]:
df.columns

Index(['Employee_Company', 'employee_id', 'Salery'], dtype='object')

In [121]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [79]:
df

     Company Person  Sales  Number
0     GOOGLE     P1   4500       1
1     GOOGLE     P2   5500       2
2  MICROSOFT     P3   6500       3
3  MICROSOFT     P4   3400       4
4   FACEBOOK     P5   2300       5
5   FACEBOOK     P6   1200       6

# Reading a csv File

In [128]:
df1 = pd.read_csv('titanic_train.csv')

In [127]:
df1.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [124]:
df1.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [125]:
df1.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [126]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB